In [5]:
import pandas as pd

In [6]:
import pandas as pd  
  
s = pd.Series([100,'a',{'dic1':5}],   
              index=pd.Index(['id1',20,'third']),   
              dtype='object',   
              name='my_idx')  
  
s.index.name = 'my_index_name'  # 设置索引名  
s.keys = ['my_key']  # 设置列名

In [7]:
s2=pd.Series([100,'a',{'dic1':5}])

In [8]:
s2.size

3

In [9]:
d= {
    "英语": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "语文": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}
df = pd.DataFrame(d)

In [10]:
books={
   "作者":pd.Series(['余华','残雪','莫言'],index=["a","b","c"]),
   "作品名称":pd.Series(['活着','暗夜','红高粱'],index=["a","b","c"])
}
df2=pd.DataFrame(books)

In [11]:
# 数据框的行索引
i = df2.index.values

In [12]:
# 获取df2
df2['作品名称']

a     活着
b     暗夜
c    红高粱
Name: 作品名称, dtype: object

In [13]:
df2.作者

a    余华
b    残雪
c    莫言
Name: 作者, dtype: object

In [14]:
df2[['作品名称','作者']]

  作品名称  作者
a   活着  余华
b   暗夜  残雪
c  红高粱  莫言

In [15]:
df2.index

# 设置行索引
gzmt=pd.read_csv(R'600519.csv')

In [16]:
gzmt.set_index

<bound method DataFrame.set_index of              day  STOCK_CODE    open   close  maximum  minimum  volume  \
0     2001-08-27     6005191   34.51   35.55    37.78    32.85  406318
1     2001-08-28     6005191   34.99   36.86    37.00    34.61  129647
2     2001-08-29     6005191   36.98   36.38    37.00    36.10   53252
3     2001-08-30     6005191   36.28   37.10    37.51    36.00   48013
4     2001-08-31     6005191   37.15   37.01    37.62    36.80   23231
...          ...         ...     ...     ...      ...      ...     ...
4089  2018-10-29     6005191  549.09  549.09   549.09   549.09   49076
4090  2018-10-30     6005191  510.00  524.00   543.00   509.02  204397
4091  2018-10-31     6005191  527.00  548.90   555.00   522.00   96885
4092  2018-11-01     6005191  555.00  563.00   585.50   551.25   98107
4093  2018-11-02     6005191  585.00  599.90   600.00   572.24   89157

         TURNOVER
0      1410347008
1       463463008
2       194689000
3       177558000
4        86231000
...           ...
4089   2694714080
4090  10663392512
4091   5239853056
4092   5581027328
4093   5227695104

[4094 rows x 8 columns]>

In [17]:
gzmt.loc[0,'day']

'2001-08-27'

In [18]:
df3=gzmt.set_index('day')

In [19]:
gzmt.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [20]:
gzmt.loc[0,'day']

'2001-08-27'

In [21]:
df3.loc['2001-08-27']

STOCK_CODE    6.005191e+06
open          3.451000e+01
close         3.555000e+01
maximum       3.778000e+01
minimum       3.285000e+01
volume        4.063180e+05
TURNOVER      1.410347e+09
Name: 2001-08-27, dtype: float64

In [22]:
# 创建布尔列表

布尔列表=[False]*4094
布尔列表[1]=True

In [23]:
df3.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-08-28     6005191  34.99  36.86     37.0    34.61  129647  463463008

In [24]:
# 使用条件表达式构造布尔列表
条件1=df3.open<35
条件2=df3.close<35
筛选条件=条件1&条件2

In [25]:
# 使用函数作为
def 筛选函数(df):
    条件1=df.open<35
    条件2=df.close<35
    筛选条件=条件1&条件2
    return 筛选条件

In [26]:
# 使用Query方法查询函数
df3.query('open<35 and close<35')

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [27]:
list1=[1,2,3,4]
list1[0]

1

In [28]:
df3.index.values

array(['2001-08-27', '2001-08-28', '2001-08-29', ..., '2018-10-31',
       '2018-11-01', '2018-11-02'], dtype=object)

In [29]:
df3.open

day
2001-08-27     34.51
2001-08-28     34.99
2001-08-29     36.98
2001-08-30     36.28
2001-08-31     37.15
               ...
2018-10-29    549.09
2018-10-30    510.00
2018-10-31    527.00
2018-11-01    555.00
2018-11-02    585.00
Name: open, Length: 4094, dtype: float64

In [30]:
df3['open']

day
2001-08-27     34.51
2001-08-28     34.99
2001-08-29     36.98
2001-08-30     36.28
2001-08-31     37.15
               ...
2018-10-29    549.09
2018-10-30    510.00
2018-10-31    527.00
2018-11-01    555.00
2018-11-02    585.00
Name: open, Length: 4094, dtype: float64

In [32]:
df3.loc['2001-08-27','open']

34.51

In [33]:
df3.loc[:'open']

            STOCK_CODE    open   close  maximum  minimum  volume     TURNOVER
day
2001-08-27     6005191   34.51   35.55    37.78    32.85  406318   1410347008
2001-08-28     6005191   34.99   36.86    37.00    34.61  129647    463463008
2001-08-29     6005191   36.98   36.38    37.00    36.10   53252    194689000
2001-08-30     6005191   36.28   37.10    37.51    36.00   48013    177558000
2001-08-31     6005191   37.15   37.01    37.62    36.80   23231     86231000
...                ...     ...     ...      ...      ...     ...          ...
2018-10-29     6005191  549.09  549.09   549.09   549.09   49076   2694714080
2018-10-30     6005191  510.00  524.00   543.00   509.02  204397  10663392512
2018-10-31     6005191  527.00  548.90   555.00   522.00   96885   5239853056
2018-11-01     6005191  555.00  563.00   585.50   551.25   98107   5581027328
2018-11-02     6005191  585.00  599.90   600.00   572.24   89157   5227695104

[4094 rows x 7 columns]